In [1]:
import pandas as pd

In [3]:
data = [10, 20, 30, 40]
s = pd.Series(data)
s

0    10
1    20
2    30
3    40
dtype: int64

In [10]:
data = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
s = pd.Series(data)
s

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [11]:
s['Ohio']

35000

In [12]:
'Ohio' in s

True

In [13]:
pd.isnull(s)

Ohio      False
Texas     False
Oregon    False
Utah      False
dtype: bool

In [23]:
import numpy as np
s['Ohio'] = np.NaN

In [24]:
s

Ohio          NaN
Texas     71000.0
Oregon    16000.0
Utah       5000.0
dtype: float64

In [25]:
data = [{'name': 'Alice', 'age': 25},
        {'name': 'Bob', 'age': 30},
        {'name': 'Charlie', 'age': 35}]
df = pd.DataFrame(data)
df

      name  age
0    Alice   25
1      Bob   30
2  Charlie   35

In [26]:
data = {'col1': [1,4,3,4,5],
        'col2': [4,5,6,7,8],
        'col3': [7,8,9,0,2]}

data = pd.DataFrame(data)

print(data)

data = data.drop(2)

data.head()

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     2

   col1  col2  col3
0     1     4     7
1     4     5     8
3     4     7     0
4     5     8     2

In [28]:
data = {'col1': [1,4,3,np.NaN,5],
        'col2': [4,np.NaN,6,np.NaN,8],
        'col3': [7,8,9,0,np.NaN]}

df = pd.DataFrame(data)

df.head()

   col1  col2  col3
0   1.0   4.0   7.0
1   4.0   NaN   8.0
2   3.0   6.0   9.0
3   NaN   NaN   0.0
4   5.0   8.0   NaN

In [29]:
df.fillna(0, inplace=True)

In [30]:
df.head()

   col1  col2  col3
0   1.0   4.0   7.0
1   4.0   0.0   8.0
2   3.0   6.0   9.0
3   0.0   0.0   0.0
4   5.0   8.0   0.0